app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" ORDER BY name
---
  def index
    @parent = find_parent Project::PARENT_TYPES
    @projects = @parent ? @parent.projects.order(:name) : Project.order(:name)

SELECT "areas".*, "t0"."project_id" AS ar_association_key_name FROM "areas" INNER JOIN "areas_projects" "t0" ON "areas"."id" = "t0"."area_id" WHERE "t0"."project_id" IN (6) ORDER BY position
---
  def show
    @project = Project.includes(:areas, :comments).friendly.find(params[:id])